Revit 2027 API
MechanicalUtils.BreakCurve Method
 Breaks the duct curve into two parts at the given position.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId BreakCurve(
	Document document,
	ElementId ductId,
	XYZ ptBreak
)
Public Shared Function BreakCurve (
	document As Document,
	ductId As ElementId,
	ptBreak As XYZ
) As ElementId
public:
static ElementId^ BreakCurve(
	Document^ document,
	ElementId^ ductId,
	XYZ^ ptBreak
)
static member BreakCurve :
        document : Document *
        ductId : ElementId *
        ptBreak : XYZ -> ElementId
Parameters
document Document
 The document.
ductId ElementId
 The element id of the duct curve to break.
ptBreak XYZ
 The break point on the duct curve.
Return Value
ElementId
 The new duct curve element id if successful otherwise if a failure occurred an invalidElementId is returned.
Exceptions
Exception | Condition
ArgumentException |  "The element is neither a duct nor a duct placeholder." -or- "The given point is not on the duct curve."
ArgumentNullException |  A non-optional argument was null
Remarks
 This method is not applicable for breaking the flex duct.
See Also
Reference
MechanicalUtils Class
Autodesk.Revit.DB.Mechanical Namespace